Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.ReferenceModelAttributes Class
 The ReferenceModelAttributes class contains attributes for reference model objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.ReferenceModel.ReferenceModelAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ReferenceModelAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class ReferenceModelAttributes
	Inherits AttributesBase
The ReferenceModel.ReferenceModelAttributes type exposes the following members.
Constructors
Name | Description
ReferenceModel.ReferenceModelAttributes
 Creates a new default reference model attributes instance that loads standard attributes.
Top
Properties
Name | Description
Color |  Obsolete.
Line
 Gets or sets the line type.
LineType |  Obsolete.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the specified attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Tekla.Structures.Drawing.ReferenceModel